# POSTTEST 2 EDA & DATASET

Nama : Herni Suhartati <br>
NIM : 2109106001 <br>
Kelas : A1 Informatika 2021 <br>

### Chocolate Bars Dataset

Import library pandas untuk menganalisis data dan prettytable untuk membuat tabel

In [138]:
import pandas as pd
from prettytable import PrettyTable

df = pd.read_csv("chocolate_bars.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2530 entries, 0 to 2529
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                2530 non-null   int64
 1   manufacturer      2530 non-null   object
 2   company_location  2530 non-null   object
 3   year_reviewed     2530 non-null   int64
 4   bean_origin       2530 non-null   object
 5   bar_name          2530 non-null   object
 6   cocoa_percent     2530 non-null   float64
 7   num_ingredients   2443 non-null   float64
 8   ingredients       2443 non-null   object
 9   review            2530 non-null   object
 10  rating            2530 non-null   float64
dtypes: float64(3), int64(2), object(6)
memory usage: 217.5+ KB

## KETENTUAN POINT 1 & 2

Mendapatkan informasi dari jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null dan memasukkan informasi tersebut ke dalam **dictionary**.

**Solusi:**
- Jumlah record : `df.shape[]` untuk mengembalikan total kolom dan total baris, untuk mengambil jumlah baris gunakan indeks 0.
- Nama atribute : `df.columns.values` untuk mengembalikan array berupa nama-nama atribute.
- Jumlah atribute dengan tipe objek: `df.select_dtypes(['object'])` untuk mengambil nilai baris dengan kolom dengan tipe data objek
- Jumlah atribute dengan tipe angka: `df.select_dtypes(['float64', 'int64'])` untuk mengambil nilai baris dengan kolom dengan tipe data angka
- Jumlah atribute null: `df.loc[:, df.isnull().any()]` mengembalikan list kolom dan value boolean tentang apakah ada data yang kosong atau tidak

In [139]:
coklat_bar = {
  'total_records': 0,
  'nama_atribute': [],
  'objek_atribute': 0,
  'angka_atribute': 0,
  'null_atribute': 0}

coklat_bar['total_records'] = df.shape[0]
coklat_bar['nama_atribute'] = list(df.columns.values)
coklat_bar['objek_atribute'] = list(df.select_dtypes(['object']))
coklat_bar['angka_atribute'] = list(df.select_dtypes(['float64', 'int64']))
coklat_bar['null_atribute'] = list(df.loc[:, df.isnull().any()])

In [140]:
table = PrettyTable(["Jenis Informasi", "Nama Attribut", "Jumlah"])
table.align = "l"

table.add_row(["Jumlah Record","-", coklat_bar['total_records']])
table.add_row(["Nama Attribut", f"{', '.join(coklat_bar['nama_atribute'])}",(len(coklat_bar['nama_atribute']))])
table.add_row(["Jumlah Attribut Objek", f"{', '.join(coklat_bar['objek_atribute'])}", ( len(coklat_bar['objek_atribute']) )])
table.add_row(["Jumlah Attribut Angka", f"{', '.join(coklat_bar['angka_atribute'])}", (len(coklat_bar['angka_atribute']))])
table.add_row(["Jumlah Attribut Null", f"{', '.join(coklat_bar['null_atribute'])}", (len(coklat_bar['null_atribute']))])


print(table)

+-----------------------+---------------------------------------------------------------------------------------------------------------------------------------+--------+
| Jenis Informasi       | Nama Attribut                                                                                                                         | Jumlah |
+-----------------------+---------------------------------------------------------------------------------------------------------------------------------------+--------+
| Jumlah Record         | -                                                                                                                                     | 2530   |
| Nama Attribut         | id, manufacturer, company_location, year_reviewed, bean_origin, bar_name, cocoa_percent, num_ingredients, ingredients, review, rating | 11     |
| Jumlah Attribut Objek | manufacturer, company_location, bean_origin, bar_name, ingredients, review                                                            | 6      |
| Jumlah Attribut Angka | id, year_reviewed, cocoa_percent, num_ingredients, rating                                                                             | 5      |
| Jumlah Attribut Null  | num_ingredients, ingredients                                                                                                          | 2      |
+-----------------------+---------------------------------------------------------------------------------------------------------------------------------------+--------+

## KETENTUAN POINT 3
Menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

**Solusi:** <br>
`df.describe()` untuk mengembalikan nilai rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari semua attribute yang bertipe data angka.

In [141]:
df.describe()

                id  year_reviewed  cocoa_percent  num_ingredients       rating
count  2530.000000    2530.000000    2530.000000      2443.000000  2530.000000
mean   1429.800791    2014.374308      71.639723         3.041343     3.196344
std     757.648556       3.968267       5.616724         0.913728     0.445321
min       5.000000    2006.000000      42.000000         1.000000     1.000000
25%     802.000000    2012.000000      70.000000         2.000000     3.000000
50%    1454.000000    2015.000000      70.000000         3.000000     3.250000
75%    2079.000000    2018.000000      74.000000         4.000000     3.500000
max    2712.000000    2021.000000     100.000000         6.000000     4.000000

## KETENTUAN POINT 4

Menampilkan nilai korelasi attribute bertipe angka

**Solusi:** <br>
untuk menampilkan korelasi bertipe data angka cukup dengan `df.corr(numeric_only=True)` tapi karena di dalam dataset ini terdapat attribut yang memiliki nilai null sehingga harus menambahkan `df.dropna()` guna untuk menghilangkan NaN.

In [142]:
df.dropna().corr(numeric_only=True)

,id,year_reviewed,cocoa_percent,num_ingredients,rating
id,1.000000,0.993091,0.047576,-0.356845,0.085569
year_reviewed,0.993091,1.000000,0.048043,-0.362956,0.087774
cocoa_percent,0.047576,0.048043,1.000000,-0.187468,-0.077173
num_ingredients,-0.356845,-0.362956,-0.187468,1.000000,-0.098834
rating,0.085569,0.087774,-0.077173,-0.098834,1.000000

## KETENTUAN POINT 5
Mengubah tipe data suatu attribut dari integer ke float atau sebaliknya.

**Solusi:** <br>
Untuk mengubah tipe data dari integer ke float cukup menggunakan syntax `df[['nama_attribute']] = df[['nama_attribute']].astype("float64")` tapi menggunakan syntax tersebut hanya menghasilkan 1 angka dibelakang koma dan yang diminta adalah 3 angka dibelakang koma, sehingga syntax yang digunakan adalah `df["nama_attribute"] = df["nama_attribute"].map('{:.3f}'.format)`.

In [143]:
df[['id']] = df[['id']].astype("float64")
df['id'].dtypes

dtype('float64')

In [144]:
df["id"] = df["id"].map('{:.3f}'.format)

## KETENTUAN POINT 6
Menampilkan 10 record pertama dari attribute bertipe data angka.

**Solusi:** <br>
Untuk menampilkan attribut dengan tipe data angka saya menggunakan fungsi `loc`.

In [145]:
attribut_angka=[]
for i in coklat_bar['angka_atribute']:
    attribut_angka.append(i)
df.loc[ :9,attribut_angka]

         id  year_reviewed  cocoa_percent  num_ingredients  rating
0  2454.000           2019           76.0              3.0    3.25
1  2458.000           2019           76.0              3.0    3.50
2  2454.000           2019           76.0              3.0    3.75
3  2542.000           2021           68.0              3.0    3.00
4  2546.000           2021           72.0              3.0    3.00
5  2546.000           2021           80.0              3.0    3.25
6  2542.000           2021           68.0              3.0    3.50
7   797.000           2012           70.0              4.0    3.50
8   797.000           2012           63.0              4.0    3.75
9  1011.000           2013           70.0              4.0    2.75

## KETENTUAN POINT 7
Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

**Solusi:** <br>
Untuk menyimpan dataset yang baru menggunakan `nama_data.to_csv("./nama_file.csv")`

In [146]:
df_angka=df[attribut_angka]
df_angka.to_csv("./dataset_coklat.csv")
df_hasil = pd.read_csv("./dataset_coklat.csv", index_col=0)
df_hasil.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2530 entries, 0 to 2529
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2530 non-null   float64
 1   year_reviewed    2530 non-null   int64
 2   cocoa_percent    2530 non-null   float64
 3   num_ingredients  2443 non-null   float64
 4   rating           2530 non-null   float64
dtypes: float64(4), int64(1)
memory usage: 118.6 KB